// const x = 0.1;
// const y = 0.2;
// const sum = x + y;

// console.log(sum); // Виведе: 0.30000000000000004 (не точне значення)
// console.log(sum.toFixed(3)); // Виведе: 0.30 (округлення до 2 десяткових знаків)


// console.log(0.17 + 0.24);// 0.41000000000000003
// console.log((0.17 * 100 + 0.24 * 100) / 100);// 0.41
// console.log(345*53456)


// console.log(Math.pow(2, 3)); // Виведе: 8 (2 в степені 3)

console.log((Math.random()* 1000).toFixed(0)); // [0, 1) - випадкове число від 0 до 1 (не включно)